zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/lcdca.h
/**
 * \file
 *
 * \brief Component description for LCDCA
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_LCDCA_COMPONENT_
#define _SAM4L_LCDCA_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR LCDCA */
/* ========================================================================== */
/** \addtogroup SAM4L_LCDCA LCD Controller */
/*@{*/

#define LCDCA_I7572
#define REV_LCDCA                   0x100

/* -------- LCDCA_CR : (LCDCA Offset: 0x00) ( /W 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DIS:1;            /*!< bit:      0  Disable                            */
    uint32_t EN:1;             /*!< bit:      1  Enable                             */
    uint32_t FC0DIS:1;         /*!< bit:      2  Frame Counter 0 Disable            */
    uint32_t FC0EN:1;          /*!< bit:      3  Frame Counter 0 Enable             */
    uint32_t FC1DIS:1;         /*!< bit:      4  Frame Counter 1 Disable            */
    uint32_t FC1EN:1;          /*!< bit:      5  Frame Counter 1 Enable             */
    uint32_t FC2DIS:1;         /*!< bit:      6  Frame Counter 2 Disable            */
    uint32_t FC2EN:1;          /*!< bit:      7  Frame Counter 2 Enable             */
    uint32_t CDM:1;            /*!< bit:      8  Clear Display Memory               */
    uint32_t WDIS:1;           /*!< bit:      9  Wake up Disable                    */
    uint32_t WEN:1;            /*!< bit:     10  Wake up Enable                     */
    uint32_t BSTART:1;         /*!< bit:     11  Blinking Start                     */
    uint32_t BSTOP:1;          /*!< bit:     12  Blinking Stop                      */
    uint32_t CSTART:1;         /*!< bit:     13  Circular Shift Start               */
    uint32_t CSTOP:1;          /*!< bit:     14  Circular Shift Stop                */
    uint32_t :17;              /*!< bit: 15..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_CR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_CR_OFFSET             0x00         /**< \brief (LCDCA_CR offset) Control Register */
#define LCDCA_CR_RESETVALUE         _U(0x00000000); /**< \brief (LCDCA_CR reset_value) Control Register */

#define LCDCA_CR_DIS_Pos            0            /**< \brief (LCDCA_CR) Disable */
#define LCDCA_CR_DIS                (_U(0x1) << LCDCA_CR_DIS_Pos)
#define LCDCA_CR_EN_Pos             1            /**< \brief (LCDCA_CR) Enable */
#define LCDCA_CR_EN                 (_U(0x1) << LCDCA_CR_EN_Pos)
#define LCDCA_CR_FC0DIS_Pos         2            /**< \brief (LCDCA_CR) Frame Counter 0 Disable */
#define LCDCA_CR_FC0DIS             (_U(0x1) << LCDCA_CR_FC0DIS_Pos)
#define LCDCA_CR_FC0EN_Pos          3            /**< \brief (LCDCA_CR) Frame Counter 0 Enable */
#define LCDCA_CR_FC0EN              (_U(0x1) << LCDCA_CR_FC0EN_Pos)
#define LCDCA_CR_FC1DIS_Pos         4            /**< \brief (LCDCA_CR) Frame Counter 1 Disable */
#define LCDCA_CR_FC1DIS             (_U(0x1) << LCDCA_CR_FC1DIS_Pos)
#define LCDCA_CR_FC1EN_Pos          5            /**< \brief (LCDCA_CR) Frame Counter 1 Enable */
#define LCDCA_CR_FC1EN              (_U(0x1) << LCDCA_CR_FC1EN_Pos)
#define LCDCA_CR_FC2DIS_Pos         6            /**< \brief (LCDCA_CR) Frame Counter 2 Disable */
#define LCDCA_CR_FC2DIS             (_U(0x1) << LCDCA_CR_FC2DIS_Pos)
#define LCDCA_CR_FC2EN_Pos          7            /**< \brief (LCDCA_CR) Frame Counter 2 Enable */
#define LCDCA_CR_FC2EN              (_U(0x1) << LCDCA_CR_FC2EN_Pos)
#define LCDCA_CR_CDM_Pos            8            /**< \brief (LCDCA_CR) Clear Display Memory */
#define LCDCA_CR_CDM                (_U(0x1) << LCDCA_CR_CDM_Pos)
#define LCDCA_CR_WDIS_Pos           9            /**< \brief (LCDCA_CR) Wake up Disable */
#define LCDCA_CR_WDIS               (_U(0x1) << LCDCA_CR_WDIS_Pos)
#define LCDCA_CR_WEN_Pos            10           /**< \brief (LCDCA_CR) Wake up Enable */
#define LCDCA_CR_WEN                (_U(0x1) << LCDCA_CR_WEN_Pos)
#define LCDCA_CR_BSTART_Pos         11           /**< \brief (LCDCA_CR) Blinking Start */
#define LCDCA_CR_BSTART             (_U(0x1) << LCDCA_CR_BSTART_Pos)
#define LCDCA_CR_BSTOP_Pos          12           /**< \brief (LCDCA_CR) Blinking Stop */
#define LCDCA_CR_BSTOP              (_U(0x1) << LCDCA_CR_BSTOP_Pos)
#define LCDCA_CR_CSTART_Pos         13           /**< \brief (LCDCA_CR) Circular Shift Start */
#define LCDCA_CR_CSTART             (_U(0x1) << LCDCA_CR_CSTART_Pos)
#define LCDCA_CR_CSTOP_Pos          14           /**< \brief (LCDCA_CR) Circular Shift Stop */
#define LCDCA_CR_CSTOP              (_U(0x1) << LCDCA_CR_CSTOP_Pos)
#define LCDCA_CR_MASK               _U(0x00007FFF) /**< \brief (LCDCA_CR) MASK Register */

/* -------- LCDCA_CFG : (LCDCA Offset: 0x04) (R/W 32) Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t XBIAS:1;          /*!< bit:      0  External Bias Generation           */
    uint32_t WMOD:1;           /*!< bit:      1  Waveform Mode                      */
    uint32_t BLANK:1;          /*!< bit:      2  Blank LCD                          */
    uint32_t LOCK:1;           /*!< bit:      3  Lock                               */
    uint32_t :4;               /*!< bit:  4.. 7  Reserved                           */
    uint32_t DUTY:2;           /*!< bit:  8.. 9  Duty Select                        */
    uint32_t :6;               /*!< bit: 10..15  Reserved                           */
    uint32_t FCST:6;           /*!< bit: 16..21  Fine Contrast                      */
    uint32_t :2;               /*!< bit: 22..23  Reserved                           */
    uint32_t NSU:6;            /*!< bit: 24..29  Number of Segment Terminals in Use */
    uint32_t :2;               /*!< bit: 30..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_CFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_CFG_OFFSET            0x04         /**< \brief (LCDCA_CFG offset) Configuration Register */
#define LCDCA_CFG_RESETVALUE        _U(0x00000000); /**< \brief (LCDCA_CFG reset_value) Configuration Register */

