zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/lcdca.h
#define LCDCA_DRH0_DATA_Pos         0            /**< \brief (LCDCA_DRH0) Segments Value */
#define LCDCA_DRH0_DATA_Msk         (_U(0xFF) << LCDCA_DRH0_DATA_Pos)
#define LCDCA_DRH0_DATA(value)      (LCDCA_DRH0_DATA_Msk & ((value) << LCDCA_DRH0_DATA_Pos))
#define LCDCA_DRH0_MASK             _U(0x000000FF) /**< \brief (LCDCA_DRH0) MASK Register */

/* -------- LCDCA_DRL1 : (LCDCA Offset: 0x1C) (R/W 32) Data Register Low 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:32;          /*!< bit:  0..31  Segments Value                     */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_DRL1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_DRL1_OFFSET           0x1C         /**< \brief (LCDCA_DRL1 offset) Data Register Low 1 */
#define LCDCA_DRL1_RESETVALUE       _U(0x00000000); /**< \brief (LCDCA_DRL1 reset_value) Data Register Low 1 */

#define LCDCA_DRL1_DATA_Pos         0            /**< \brief (LCDCA_DRL1) Segments Value */
#define LCDCA_DRL1_DATA_Msk         (_U(0xFFFFFFFF) << LCDCA_DRL1_DATA_Pos)
#define LCDCA_DRL1_DATA(value)      (LCDCA_DRL1_DATA_Msk & ((value) << LCDCA_DRL1_DATA_Pos))
#define LCDCA_DRL1_MASK             _U(0xFFFFFFFF) /**< \brief (LCDCA_DRL1) MASK Register */

/* -------- LCDCA_DRH1 : (LCDCA Offset: 0x20) (R/W 32) Data Register High 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:8;           /*!< bit:  0.. 7  Segments Value                     */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_DRH1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_DRH1_OFFSET           0x20         /**< \brief (LCDCA_DRH1 offset) Data Register High 1 */
#define LCDCA_DRH1_RESETVALUE       _U(0x00000000); /**< \brief (LCDCA_DRH1 reset_value) Data Register High 1 */

#define LCDCA_DRH1_DATA_Pos         0            /**< \brief (LCDCA_DRH1) Segments Value */
#define LCDCA_DRH1_DATA_Msk         (_U(0xFF) << LCDCA_DRH1_DATA_Pos)
#define LCDCA_DRH1_DATA(value)      (LCDCA_DRH1_DATA_Msk & ((value) << LCDCA_DRH1_DATA_Pos))
#define LCDCA_DRH1_MASK             _U(0x000000FF) /**< \brief (LCDCA_DRH1) MASK Register */

/* -------- LCDCA_DRL2 : (LCDCA Offset: 0x24) (R/W 32) Data Register Low 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:32;          /*!< bit:  0..31  Segments Value                     */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_DRL2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_DRL2_OFFSET           0x24         /**< \brief (LCDCA_DRL2 offset) Data Register Low 2 */
#define LCDCA_DRL2_RESETVALUE       _U(0x00000000); /**< \brief (LCDCA_DRL2 reset_value) Data Register Low 2 */

#define LCDCA_DRL2_DATA_Pos         0            /**< \brief (LCDCA_DRL2) Segments Value */
#define LCDCA_DRL2_DATA_Msk         (_U(0xFFFFFFFF) << LCDCA_DRL2_DATA_Pos)
#define LCDCA_DRL2_DATA(value)      (LCDCA_DRL2_DATA_Msk & ((value) << LCDCA_DRL2_DATA_Pos))
#define LCDCA_DRL2_MASK             _U(0xFFFFFFFF) /**< \brief (LCDCA_DRL2) MASK Register */

/* -------- LCDCA_DRH2 : (LCDCA Offset: 0x28) (R/W 32) Data Register High 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:8;           /*!< bit:  0.. 7  Segments Value                     */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_DRH2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_DRH2_OFFSET           0x28         /**< \brief (LCDCA_DRH2 offset) Data Register High 2 */
#define LCDCA_DRH2_RESETVALUE       _U(0x00000000); /**< \brief (LCDCA_DRH2 reset_value) Data Register High 2 */

#define LCDCA_DRH2_DATA_Pos         0            /**< \brief (LCDCA_DRH2) Segments Value */
#define LCDCA_DRH2_DATA_Msk         (_U(0xFF) << LCDCA_DRH2_DATA_Pos)
#define LCDCA_DRH2_DATA(value)      (LCDCA_DRH2_DATA_Msk & ((value) << LCDCA_DRH2_DATA_Pos))
#define LCDCA_DRH2_MASK             _U(0x000000FF) /**< \brief (LCDCA_DRH2) MASK Register */

/* -------- LCDCA_DRL3 : (LCDCA Offset: 0x2C) (R/W 32) Data Register Low 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:32;          /*!< bit:  0..31  Segments Value                     */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_DRL3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_DRL3_OFFSET           0x2C         /**< \brief (LCDCA_DRL3 offset) Data Register Low 3 */
#define LCDCA_DRL3_RESETVALUE       _U(0x00000000); /**< \brief (LCDCA_DRL3 reset_value) Data Register Low 3 */

#define LCDCA_DRL3_DATA_Pos         0            /**< \brief (LCDCA_DRL3) Segments Value */
#define LCDCA_DRL3_DATA_Msk         (_U(0xFFFFFFFF) << LCDCA_DRL3_DATA_Pos)
#define LCDCA_DRL3_DATA(value)      (LCDCA_DRL3_DATA_Msk & ((value) << LCDCA_DRL3_DATA_Pos))
#define LCDCA_DRL3_MASK             _U(0xFFFFFFFF) /**< \brief (LCDCA_DRL3) MASK Register */

