zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/lcdca.h
/* -------- LCDCA_CMCFG : (LCDCA Offset: 0x40) (R/W 32) Character Mapping Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DREV:1;           /*!< bit:      0  Digit Reverse Mode                 */
    uint32_t TDG:2;            /*!< bit:  1.. 2  Type of Digit                      */
    uint32_t :5;               /*!< bit:  3.. 7  Reserved                           */
    uint32_t STSEG:6;          /*!< bit:  8..13  Start Segment                      */
    uint32_t :18;              /*!< bit: 14..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_CMCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_CMCFG_OFFSET          0x40         /**< \brief (LCDCA_CMCFG offset) Character Mapping Configuration Register */
#define LCDCA_CMCFG_RESETVALUE      _U(0x00000000); /**< \brief (LCDCA_CMCFG reset_value) Character Mapping Configuration Register */

#define LCDCA_CMCFG_DREV_Pos        0            /**< \brief (LCDCA_CMCFG) Digit Reverse Mode */
#define LCDCA_CMCFG_DREV            (_U(0x1) << LCDCA_CMCFG_DREV_Pos)
#define LCDCA_CMCFG_TDG_Pos         1            /**< \brief (LCDCA_CMCFG) Type of Digit */
#define LCDCA_CMCFG_TDG_Msk         (_U(0x3) << LCDCA_CMCFG_TDG_Pos)
#define LCDCA_CMCFG_TDG(value)      (LCDCA_CMCFG_TDG_Msk & ((value) << LCDCA_CMCFG_TDG_Pos))
#define LCDCA_CMCFG_STSEG_Pos       8            /**< \brief (LCDCA_CMCFG) Start Segment */
#define LCDCA_CMCFG_STSEG_Msk       (_U(0x3F) << LCDCA_CMCFG_STSEG_Pos)
#define LCDCA_CMCFG_STSEG(value)    (LCDCA_CMCFG_STSEG_Msk & ((value) << LCDCA_CMCFG_STSEG_Pos))
#define LCDCA_CMCFG_MASK            _U(0x00003F07) /**< \brief (LCDCA_CMCFG) MASK Register */

/* -------- LCDCA_CMDR : (LCDCA Offset: 0x44) ( /W 32) Character Mapping Data Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ASCII:7;          /*!< bit:  0.. 6  ASCII Code                         */
    uint32_t :25;              /*!< bit:  7..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_CMDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_CMDR_OFFSET           0x44         /**< \brief (LCDCA_CMDR offset) Character Mapping Data Register */
#define LCDCA_CMDR_RESETVALUE       _U(0x00000000); /**< \brief (LCDCA_CMDR reset_value) Character Mapping Data Register */

#define LCDCA_CMDR_ASCII_Pos        0            /**< \brief (LCDCA_CMDR) ASCII Code */
#define LCDCA_CMDR_ASCII_Msk        (_U(0x7F) << LCDCA_CMDR_ASCII_Pos)
#define LCDCA_CMDR_ASCII(value)     (LCDCA_CMDR_ASCII_Msk & ((value) << LCDCA_CMDR_ASCII_Pos))
#define LCDCA_CMDR_MASK             _U(0x0000007F) /**< \brief (LCDCA_CMDR) MASK Register */

/* -------- LCDCA_ACMCFG : (LCDCA Offset: 0x48) (R/W 32) Automated Character Mapping Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EN:1;             /*!< bit:      0  Enable                             */
    uint32_t FCS:2;            /*!< bit:  1.. 2  Frame Counter Selection            */
    uint32_t MODE:1;           /*!< bit:      3  Mode (sequential or scrolling)     */
    uint32_t DREV:1;           /*!< bit:      4  Digit Reverse                      */
    uint32_t TDG:2;            /*!< bit:  5.. 6  Type of Digit                      */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t STSEG:6;          /*!< bit:  8..13  Start Segment                      */
    uint32_t :2;               /*!< bit: 14..15  Reserved                           */
    uint32_t STEPS:8;          /*!< bit: 16..23  Scrolling Steps                    */
    uint32_t DIGN:4;           /*!< bit: 24..27  Digit Number                       */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_ACMCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_ACMCFG_OFFSET         0x48         /**< \brief (LCDCA_ACMCFG offset) Automated Character Mapping Configuration Register */
#define LCDCA_ACMCFG_RESETVALUE     _U(0x00000000); /**< \brief (LCDCA_ACMCFG reset_value) Automated Character Mapping Configuration Register */

#define LCDCA_ACMCFG_EN_Pos         0            /**< \brief (LCDCA_ACMCFG) Enable */
#define LCDCA_ACMCFG_EN             (_U(0x1) << LCDCA_ACMCFG_EN_Pos)
#define LCDCA_ACMCFG_FCS_Pos        1            /**< \brief (LCDCA_ACMCFG) Frame Counter Selection */
#define LCDCA_ACMCFG_FCS_Msk        (_U(0x3) << LCDCA_ACMCFG_FCS_Pos)
#define LCDCA_ACMCFG_FCS(value)     (LCDCA_ACMCFG_FCS_Msk & ((value) << LCDCA_ACMCFG_FCS_Pos))
#define LCDCA_ACMCFG_MODE_Pos       3            /**< \brief (LCDCA_ACMCFG) Mode (sequential or scrolling) */
#define LCDCA_ACMCFG_MODE           (_U(0x1) << LCDCA_ACMCFG_MODE_Pos)
#define LCDCA_ACMCFG_DREV_Pos       4            /**< \brief (LCDCA_ACMCFG) Digit Reverse */
#define LCDCA_ACMCFG_DREV           (_U(0x1) << LCDCA_ACMCFG_DREV_Pos)
#define LCDCA_ACMCFG_TDG_Pos        5            /**< \brief (LCDCA_ACMCFG) Type of Digit */
#define LCDCA_ACMCFG_TDG_Msk        (_U(0x3) << LCDCA_ACMCFG_TDG_Pos)
#define LCDCA_ACMCFG_TDG(value)     (LCDCA_ACMCFG_TDG_Msk & ((value) << LCDCA_ACMCFG_TDG_Pos))
#define LCDCA_ACMCFG_STSEG_Pos      8            /**< \brief (LCDCA_ACMCFG) Start Segment */
#define LCDCA_ACMCFG_STSEG_Msk      (_U(0x3F) << LCDCA_ACMCFG_STSEG_Pos)
#define LCDCA_ACMCFG_STSEG(value)   (LCDCA_ACMCFG_STSEG_Msk & ((value) << LCDCA_ACMCFG_STSEG_Pos))
#define LCDCA_ACMCFG_STEPS_Pos      16           /**< \brief (LCDCA_ACMCFG) Scrolling Steps */
#define LCDCA_ACMCFG_STEPS_Msk      (_U(0xFF) << LCDCA_ACMCFG_STEPS_Pos)
#define LCDCA_ACMCFG_STEPS(value)   (LCDCA_ACMCFG_STEPS_Msk & ((value) << LCDCA_ACMCFG_STEPS_Pos))
#define LCDCA_ACMCFG_DIGN_Pos       24           /**< \brief (LCDCA_ACMCFG) Digit Number */
#define LCDCA_ACMCFG_DIGN_Msk       (_U(0xF) << LCDCA_ACMCFG_DIGN_Pos)
#define LCDCA_ACMCFG_DIGN(value)    (LCDCA_ACMCFG_DIGN_Msk & ((value) << LCDCA_ACMCFG_DIGN_Pos))
#define LCDCA_ACMCFG_MASK           _U(0x0FFF3F7F) /**< \brief (LCDCA_ACMCFG) MASK Register */

/* -------- LCDCA_ACMDR : (LCDCA Offset: 0x4C) ( /W 32) Automated Character Mapping Data Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ASCII:7;          /*!< bit:  0.. 6  ASCII Code                         */
    uint32_t :25;              /*!< bit:  7..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_ACMDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_ACMDR_OFFSET          0x4C         /**< \brief (LCDCA_ACMDR offset) Automated Character Mapping Data Register */
#define LCDCA_ACMDR_RESETVALUE      _U(0x00000000); /**< \brief (LCDCA_ACMDR reset_value) Automated Character Mapping Data Register */

