zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/lcdca.h
#define LCDCA_ACMDR_ASCII_Pos       0            /**< \brief (LCDCA_ACMDR) ASCII Code */
#define LCDCA_ACMDR_ASCII_Msk       (_U(0x7F) << LCDCA_ACMDR_ASCII_Pos)
#define LCDCA_ACMDR_ASCII(value)    (LCDCA_ACMDR_ASCII_Msk & ((value) << LCDCA_ACMDR_ASCII_Pos))
#define LCDCA_ACMDR_MASK            _U(0x0000007F) /**< \brief (LCDCA_ACMDR) MASK Register */

/* -------- LCDCA_ABMCFG : (LCDCA Offset: 0x50) (R/W 32) Automated Bit Mapping Configuration Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EN:1;             /*!< bit:      0  Enable                             */
    uint32_t FCS:2;            /*!< bit:  1.. 2  Frame Counter Selection            */
    uint32_t :5;               /*!< bit:  3.. 7  Reserved                           */
    uint32_t SIZE:5;           /*!< bit:  8..12  Size                               */
    uint32_t :19;              /*!< bit: 13..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_ABMCFG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_ABMCFG_OFFSET         0x50         /**< \brief (LCDCA_ABMCFG offset) Automated Bit Mapping Configuration Register */
#define LCDCA_ABMCFG_RESETVALUE     _U(0x00000000); /**< \brief (LCDCA_ABMCFG reset_value) Automated Bit Mapping Configuration Register */

#define LCDCA_ABMCFG_EN_Pos         0            /**< \brief (LCDCA_ABMCFG) Enable */
#define LCDCA_ABMCFG_EN             (_U(0x1) << LCDCA_ABMCFG_EN_Pos)
#define LCDCA_ABMCFG_FCS_Pos        1            /**< \brief (LCDCA_ABMCFG) Frame Counter Selection */
#define LCDCA_ABMCFG_FCS_Msk        (_U(0x3) << LCDCA_ABMCFG_FCS_Pos)
#define LCDCA_ABMCFG_FCS(value)     (LCDCA_ABMCFG_FCS_Msk & ((value) << LCDCA_ABMCFG_FCS_Pos))
#define LCDCA_ABMCFG_SIZE_Pos       8            /**< \brief (LCDCA_ABMCFG) Size */
#define LCDCA_ABMCFG_SIZE_Msk       (_U(0x1F) << LCDCA_ABMCFG_SIZE_Pos)
#define LCDCA_ABMCFG_SIZE(value)    (LCDCA_ABMCFG_SIZE_Msk & ((value) << LCDCA_ABMCFG_SIZE_Pos))
#define LCDCA_ABMCFG_MASK           _U(0x00001F07) /**< \brief (LCDCA_ABMCFG) MASK Register */

/* -------- LCDCA_ABMDR : (LCDCA Offset: 0x54) ( /W 32) Automated Bit Mapping Data Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DATA:8;           /*!< bit:  0.. 7  Segments Value                     */
    uint32_t DMASK:8;          /*!< bit:  8..15  Data Mask                          */
    uint32_t OFF:5;            /*!< bit: 16..20  Byte Offset                        */
    uint32_t :11;              /*!< bit: 21..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_ABMDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_ABMDR_OFFSET          0x54         /**< \brief (LCDCA_ABMDR offset) Automated Bit Mapping Data Register */
#define LCDCA_ABMDR_RESETVALUE      _U(0x00000000); /**< \brief (LCDCA_ABMDR reset_value) Automated Bit Mapping Data Register */

#define LCDCA_ABMDR_DATA_Pos        0            /**< \brief (LCDCA_ABMDR) Segments Value */
#define LCDCA_ABMDR_DATA_Msk        (_U(0xFF) << LCDCA_ABMDR_DATA_Pos)
#define LCDCA_ABMDR_DATA(value)     (LCDCA_ABMDR_DATA_Msk & ((value) << LCDCA_ABMDR_DATA_Pos))
#define LCDCA_ABMDR_DMASK_Pos       8            /**< \brief (LCDCA_ABMDR) Data Mask */
#define LCDCA_ABMDR_DMASK_Msk       (_U(0xFF) << LCDCA_ABMDR_DMASK_Pos)
#define LCDCA_ABMDR_DMASK(value)    (LCDCA_ABMDR_DMASK_Msk & ((value) << LCDCA_ABMDR_DMASK_Pos))
#define LCDCA_ABMDR_OFF_Pos         16           /**< \brief (LCDCA_ABMDR) Byte Offset */
#define LCDCA_ABMDR_OFF_Msk         (_U(0x1F) << LCDCA_ABMDR_OFF_Pos)
#define LCDCA_ABMDR_OFF(value)      (LCDCA_ABMDR_OFF_Msk & ((value) << LCDCA_ABMDR_OFF_Pos))
#define LCDCA_ABMDR_MASK            _U(0x001FFFFF) /**< \brief (LCDCA_ABMDR) MASK Register */

/* -------- LCDCA_IER : (LCDCA Offset: 0x58) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t FC0R:1;           /*!< bit:      0  Frame Counter 0 Rollover           */
    uint32_t :31;              /*!< bit:  1..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_IER_OFFSET            0x58         /**< \brief (LCDCA_IER offset) Interrupt Enable Register */
#define LCDCA_IER_RESETVALUE        _U(0x00000000); /**< \brief (LCDCA_IER reset_value) Interrupt Enable Register */

#define LCDCA_IER_FC0R_Pos          0            /**< \brief (LCDCA_IER) Frame Counter 0 Rollover */
#define LCDCA_IER_FC0R              (_U(0x1) << LCDCA_IER_FC0R_Pos)
#define LCDCA_IER_MASK              _U(0x00000001) /**< \brief (LCDCA_IER) MASK Register */

/* -------- LCDCA_IDR : (LCDCA Offset: 0x5C) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t FC0R:1;           /*!< bit:      0  Frame Counter 0 Rollover           */
    uint32_t :31;              /*!< bit:  1..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} LCDCA_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define LCDCA_IDR_OFFSET            0x5C         /**< \brief (LCDCA_IDR offset) Interrupt Disable Register */
#define LCDCA_IDR_RESETVALUE        _U(0x00000000); /**< \brief (LCDCA_IDR reset_value) Interrupt Disable Register */

#define LCDCA_IDR_FC0R_Pos          0            /**< \brief (LCDCA_IDR) Frame Counter 0 Rollover */
#define LCDCA_IDR_FC0R              (_U(0x1) << LCDCA_IDR_FC0R_Pos)
#define LCDCA_IDR_MASK              _U(0x00000001) /**< \brief (LCDCA_IDR) MASK Register */

